package com.company.home_work.home_work_01;
/*
1) Создать по одной переменной каждого типа данных, который ты знаешь.
2) Присвоить каждой переменной значение в диапазоне типа.
3) Вывести значение каждой переменной в консоль, каждое значение выводить с новой строки.
*/

public class HW_01_2 {
    public static void main(String[] args){
        int i=205;
        byte b=30;
        char c='r';
        boolean bl=true;
        short s=351;
        float f=35.3f;
        double d=74.3;
        long l=2378653156L;
        String str="GH";

        System.out.println(i);
        System.out.println(b);
        System.out.println(c);
        System.out.println(bl);
        System.out.println(s);
        System.out.println(f);
        System.out.println(d);
        System.out.println(l);
        System.out.println(str);


    }
}
